import * as yup from 'yup';

export const createProjectFormSchema = yup.object().shape({
  category: yup.number().required('Выберите категорию.'),
  header: yup
    .string()
    .min(1, 'Укажите заголовок от 1 до 60 символов.')
    .max(60, 'Укажите заголовок от 1 до 60 символов.')
    .required('Укажите заголовок от 1 до 60 символов.'),
  description: yup
    .string()
    .min(1, 'Укажите краткое описание от 1 до 120 символов.')
    .max(120, 'Укажите краткое описание от 1 до 120 символов.')
    .required('Укажите краткое описание от 1 до 120 символов.'),
  text: yup
    .string()
    .min(1, 'Укажите описание от 1 до 2000 символов.')
    .max(2000, 'Укажите описание от 1 до 2000 символов.')
    .required('Укажите описание от 1 до 2000 символов.'),
  price: yup
    .number()
    .min(1, 'Укажите бюджет от 1 до 1000000 рублей')
    .max(1000000, 'Укажите бюджет от 1 до 1000000 рублей')
});
